Examples/manipulateFvSolutionFvSchemes/pitzDailyStateMachineSwitched/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs (
    "libswakStateMachine.so"
);

functions
{
    solutionMachine {
        type stateMachineCreateAndUpdate;
        valueType patch;
        patchName inlet;
        machineName relaxationMachine;
        states (
            normal
            high
        );
        initialState normal;
        transitions (
            {
                from normal;
                to high;
                condition "time()>200";
                logicalAccumulation and;
                description "Try higher relaxation";
            }
        );
    }
    schemesMachine {
        $solutionMachine;
        machineName divMachine;
        states (
            upwind
            linear
        );
        initialState linear;
        transitions (
            {
                from upwind;
                to linear;
                condition "stateMachine_timeSinceChange(divMachine)>=45";
                logicalAccumulation or;
                description "Try working differently";
            }
            {
                from linear;
                to upwind;
                condition "stateMachine_timeSinceChange(divMachine)>=5";
                logicalAccumulation or;
                description "Slow down";
            }
        );
    }
    switchSolverSettings
    {
        type stateMachineFvSolutionFvSchemes;
        outputControlMode timeStep;
        outputInterval 1;
        solutionStateMachine relaxationMachine;
        stateToSolution (
            high higherRelax
        );
        schemesStateMachine divMachine;
        stateToSchemes (
            linear linearDiv
        );
        resetBeforeTrigger true;
    }
}

// ************************************************************************* //
